{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "results/pruning/single-shot/qwen-qwen2.5-1.5b/qwen-qwen2.5-1.5b_weighted_mean_p40_tblock_avg_singlelayer_healed",
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "qalora_group_size": 16,
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "down_proj",
    "w3",
    "dense_4h_to_h",
    "w1",
    "o_proj",
    "w2",
    "k_proj",
    "gate_proj",
    "dense_h_to_4h",
    "q_proj",
    "v_proj",
    "up_proj"
  ],
  "target_parameters": null,
  "task_type": "CAUSAL_LM",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}